---
layout: post
title: "EVAL"
description: ""
category: ""
tags: []
---
{% include JB/setup %}

[EVAL官方资料](http://redis.io/commands/EVAL)

## EVAL介绍

EVAL是内建在redis中的命令，用来执行lua脚本。

EVAL有一系列参数：

* 第一个参数是lua脚本，这个脚本会在redis服务端运行，这个脚本不应该定义lua函数；
* 第二个参数是一个数字，用来指出接下来会有几个参数；
* 之后是一系列参数，参数个数由第二个参数指定，这些参数可以在lua脚本中通过KEYS关键字访问，例如，要访问这些参数中的第一个，可以用KEYS[1]；
* 之后还可以列出一系列参数，这些参数在lua中用作全局变量，使用ARGV访问

一个例子，在redis客户端运行：

	> eval "return {KEYS[1],KEYS[2],ARGV[1],ARGV[2],ARGV[3]}" 2 key1 key2 first second third
	1) "key1"
	2) "key2"
	3) "first"
	4) "second"
	5) "third"

在lua脚本中执行redis命令可以使用如下另个lua函数：

* redis.call()
* redis.pcall()

两个函数的区别是在redis命令执行出错时，会有不同的处理。

一个例子：

	> eval "return redis.call('set','foo','bar')" 0
	OK
	> eval "return redis.call('set',KEYS[1],'bar')" 1 foo2
	OK
	> eval "return redis.call('get', 'foo')" 0
	"bar"

<!--more-->

## lua和redis数据类型转换

在lua中执行redis调用，或lua返回结果给redis，相应的类型会自动转换，转换规则如下：

Redis to Lua

* integer -> number
* bulk -> string
* multi bulk -> table
* status -> table with a single ok field containing the status
* error -> table with a single err field containing the error
* nil bulk and multi bulk -> false boolean type

Lua转换成Redis有一条额外的规则：

* Lua boolean true -> Redis integer reply with vaue of 1

一个例子：

	> eval "return 10" 0
	(integer) 10

	> eval "return {1,2,{3,'Hello World!'}}" 0
	1) (integer) 1
	2) (integer) 2
	3) 1) (integer) 3
	   2) "Hello World!"

	> eval "return redis.call('get','foo')" 0
	"bar"

	> eval "return {1,2,3.3333,'foo',nil,'bar'}" 0
	1) (integer) 1
	2) (integer) 2
	3) (integer) 3
	4) "foo"
